FS-1-Exp4/4.3/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 20
      name: "Load test - concurrent booking"

scenarios:
  - name: "Book a seat"
    flow:
      - post:
          url: "/api/book"
          json: {}
          expect:
            - statusCode:
                - 200
                - 400